module.exports = {
    eventsAround: "🔍  Ивенты вокруг меня",
    eventsAroundRetry: "🔍  Попробовать еще раз",
    eventsToday: "📅  Ивенты на сегодня",
    eventsTodayRetry: "📅 Попробовать еще раз",
    back: "◀️  Вернуться",
    feelingLucky: "🍀  Мне сегодня повезет!",
    locationRequest: markup => markup.locationRequestButton("🌍  Отправить текущее местоположение"),
    near: "🎯  Неподалеку",
    walk: "🚶‍♂️  Готов прогуляться",
    subscribe: "✉️  Подписаться",
    preferences: "⚙️  Предпочтения",
    confirmSubscription: "👌  Продолжаем",
    digestsEveryDay: "⚡️  Каждый день",
    digestsEveryWeekday: "🚀  По будним дням",
    digestsBeforeWeekend: "🎉  Пятница + выходные"
};