module.exports = {
    start: "🤖  Чем могу помочь?",
    sendLocation: "🤖  Пожалуйста, пришлите свое местоположение",
    eventsToday: "💥 *Дайджест мероприятий на сегодня*",
    noEventsForToday: "🤖  Я очень старался, но не нашел актуальных бесплатных мероприятий на сегодня... Быть может, повезет в другой раз?",
    noEventsAround: "🤖  Я очень старался, но не нашел актуальных бесплатных мероприятий в округе... Быть может, повезет в другой раз?",
    afterSearch: "🤖  Что-нибудь еще?",
    refineSearchRadius: "🤖  Как далеко ищем?",
    askForLocation: "🤖  Пожалуйста, пришлите свое текущее местоположение, нажав на кнопку ниже. Обратите внимание: функция доступна только на мобильной версии Telegram.",
    eventsAround: "💥  *Мероприятия вокруг вас*"
};